app/controllers/bids_controller.rb

INSERT INTO "bids" ("item_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["item_id", 1], ["amount", "5005.0"], ["created_at", "2018-05-29 21:43:04.943409"], ["updated_at", "2018-05-29 21:43:04.943409"]]
---
  def create
    @bid = Bid.new(bid_params)
    if @bid.save